Iteration 0
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
flatten_1 (Flatten)          (None, 784)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 2)                 1570      
_________________________________________________________________
dense_2 (Dense)              (None, 2)                 6         
_________________________________________________________________
dense_3 (Dense)              (None, 2)                 6         
_________________________________________________________________
dense_4 (Dense)              (None, 2)                 6         
_________________________________________________________________
dense_5 (Dense)              (None, 2)                 6         
_________________________________________________________________
dense_6 (Dense)              (None, 2)                 6         
_________________________________________________________________
dense_7 (Dense)              (None, 2)                 6         
_________________________________________________________________
dense_8 (Dense)              (None, 2)                 6         
_________________________________________________________________
dense_9 (Dense)              (None, 2)                 6         
=================================================================
Total params: 1,618
Trainable params: 1,618
Non-trainable params: 0
_________________________________________________________________

batch size = 4
epochs = 5
loss = categorical_crossentropy
optimizer = adam

Iteration 1
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
flatten_2 (Flatten)          (None, 784)               0         
_________________________________________________________________
dense_10 (Dense)             (None, 20)                15700     
_________________________________________________________________
dense_11 (Dense)             (None, 20)                420       
_________________________________________________________________
dense_12 (Dense)             (None, 20)                420       
_________________________________________________________________
dense_13 (Dense)             (None, 20)                420       
_________________________________________________________________
dense_14 (Dense)             (None, 20)                420       
_________________________________________________________________
dense_15 (Dense)             (None, 20)                420       
_________________________________________________________________
dense_16 (Dense)             (None, 20)                420       
_________________________________________________________________
dense_17 (Dense)             (None, 20)                420       
_________________________________________________________________
dense_18 (Dense)             (None, 2)                 42        
=================================================================
Total params: 18,682
Trainable params: 18,682
Non-trainable params: 0
_________________________________________________________________

batch size = 116
epochs = 5
loss = categorical_crossentropy
optimizer = adam

Iteration 2
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
flatten_3 (Flatten)          (None, 784)               0         
_________________________________________________________________
dense_19 (Dense)             (None, 10)                7850      
_________________________________________________________________
dense_20 (Dense)             (None, 10)                110       
_________________________________________________________________
dense_21 (Dense)             (None, 10)                110       
_________________________________________________________________
dense_22 (Dense)             (None, 10)                110       
_________________________________________________________________
dense_23 (Dense)             (None, 10)                110       
_________________________________________________________________
dense_24 (Dense)             (None, 10)                110       
_________________________________________________________________
dense_25 (Dense)             (None, 10)                110       
_________________________________________________________________
dense_26 (Dense)             (None, 10)                110       
_________________________________________________________________
dense_27 (Dense)             (None, 10)                110       
_________________________________________________________________
dense_28 (Dense)             (None, 10)                110       
_________________________________________________________________
dense_29 (Dense)             (None, 2)                 22        
=================================================================
Total params: 8,862
Trainable params: 8,862
Non-trainable params: 0
_________________________________________________________________

batch size = 16
epochs = 5
loss = categorical_crossentropy
optimizer = adam

Iteration 3
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
flatten_4 (Flatten)          (None, 784)               0         
_________________________________________________________________
dense_30 (Dense)             (None, 14)                10990     
_________________________________________________________________
dense_31 (Dense)             (None, 14)                210       
_________________________________________________________________
dense_32 (Dense)             (None, 14)                210       
_________________________________________________________________
dense_33 (Dense)             (None, 14)                210       
_________________________________________________________________
dense_34 (Dense)             (None, 14)                210       
_________________________________________________________________
dense_35 (Dense)             (None, 14)                210       
_________________________________________________________________
dense_36 (Dense)             (None, 14)                210       
_________________________________________________________________
dense_37 (Dense)             (None, 14)                210       
_________________________________________________________________
dense_38 (Dense)             (None, 2)                 30        
=================================================================
Total params: 12,490
Trainable params: 12,490
Non-trainable params: 0
_________________________________________________________________

batch size = 79
epochs = 5
loss = categorical_crossentropy
optimizer = adam

Iteration 4
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
flatten_5 (Flatten)          (None, 784)               0         
_________________________________________________________________
dense_39 (Dense)             (None, 4)                 3140      
_________________________________________________________________
dense_40 (Dense)             (None, 4)                 20        
_________________________________________________________________
dense_41 (Dense)             (None, 4)                 20        
_________________________________________________________________
dense_42 (Dense)             (None, 4)                 20        
_________________________________________________________________
dense_43 (Dense)             (None, 4)                 20        
_________________________________________________________________
dense_44 (Dense)             (None, 4)                 20        
_________________________________________________________________
dense_45 (Dense)             (None, 2)                 10        
=================================================================
Total params: 3,250
Trainable params: 3,250
Non-trainable params: 0
_________________________________________________________________

batch size = 76
epochs = 5
loss = categorical_crossentropy
optimizer = adam

Iteration 5
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
flatten_6 (Flatten)          (None, 784)               0         
_________________________________________________________________
dense_46 (Dense)             (None, 15)                11775     
_________________________________________________________________
dense_47 (Dense)             (None, 15)                240       
_________________________________________________________________
dense_48 (Dense)             (None, 15)                240       
_________________________________________________________________
dense_49 (Dense)             (None, 15)                240       
_________________________________________________________________
dense_50 (Dense)             (None, 15)                240       
_________________________________________________________________
dense_51 (Dense)             (None, 15)                240       
_________________________________________________________________
dense_52 (Dense)             (None, 15)                240       
_________________________________________________________________
dense_53 (Dense)             (None, 15)                240       
_________________________________________________________________
dense_54 (Dense)             (None, 15)                240       
_________________________________________________________________
dense_55 (Dense)             (None, 15)                240       
_________________________________________________________________
dense_56 (Dense)             (None, 2)                 32        
=================================================================
Total params: 13,967
Trainable params: 13,967
Non-trainable params: 0
_________________________________________________________________

batch size = 78
epochs = 5
loss = categorical_crossentropy
optimizer = adam

Iteration 6
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
flatten_7 (Flatten)          (None, 784)               0         
_________________________________________________________________
dense_57 (Dense)             (None, 1)                 785       
_________________________________________________________________
dense_58 (Dense)             (None, 1)                 2         
_________________________________________________________________
dense_59 (Dense)             (None, 2)                 4         
=================================================================
Total params: 791
Trainable params: 791
Non-trainable params: 0
_________________________________________________________________

batch size = 48
epochs = 5
loss = categorical_crossentropy
optimizer = adam

Iteration 7
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
flatten_8 (Flatten)          (None, 784)               0         
_________________________________________________________________
dense_60 (Dense)             (None, 3)                 2355      
_________________________________________________________________
dense_61 (Dense)             (None, 3)                 12        
_________________________________________________________________
dense_62 (Dense)             (None, 3)                 12        
_________________________________________________________________
dense_63 (Dense)             (None, 3)                 12        
_________________________________________________________________
dense_64 (Dense)             (None, 2)                 8         
=================================================================
Total params: 2,399
Trainable params: 2,399
Non-trainable params: 0
_________________________________________________________________

batch size = 58
epochs = 5
loss = categorical_crossentropy
optimizer = adam

Iteration 8
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
flatten_9 (Flatten)          (None, 784)               0         
_________________________________________________________________
dense_65 (Dense)             (None, 8)                 6280      
_________________________________________________________________
dense_66 (Dense)             (None, 8)                 72        
_________________________________________________________________
dense_67 (Dense)             (None, 8)                 72        
_________________________________________________________________
dense_68 (Dense)             (None, 8)                 72        
_________________________________________________________________
dense_69 (Dense)             (None, 8)                 72        
_________________________________________________________________
dense_70 (Dense)             (None, 8)                 72        
_________________________________________________________________
dense_71 (Dense)             (None, 8)                 72        
_________________________________________________________________
dense_72 (Dense)             (None, 8)                 72        
_________________________________________________________________
dense_73 (Dense)             (None, 8)                 72        
_________________________________________________________________
dense_74 (Dense)             (None, 2)                 18        
=================================================================
Total params: 6,874
Trainable params: 6,874
Non-trainable params: 0
_________________________________________________________________

batch size = 55
epochs = 5
loss = categorical_crossentropy
optimizer = adam

Iteration 9
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
flatten_10 (Flatten)         (None, 784)               0         
_________________________________________________________________
dense_75 (Dense)             (None, 18)                14130     
_________________________________________________________________
dense_76 (Dense)             (None, 18)                342       
_________________________________________________________________
dense_77 (Dense)             (None, 18)                342       
_________________________________________________________________
dense_78 (Dense)             (None, 18)                342       
_________________________________________________________________
dense_79 (Dense)             (None, 18)                342       
_________________________________________________________________
dense_80 (Dense)             (None, 18)                342       
_________________________________________________________________
dense_81 (Dense)             (None, 18)                342       
_________________________________________________________________
dense_82 (Dense)             (None, 18)                342       
_________________________________________________________________
dense_83 (Dense)             (None, 18)                342       
_________________________________________________________________
dense_84 (Dense)             (None, 2)                 38        
=================================================================
Total params: 16,904
Trainable params: 16,904
Non-trainable params: 0
_________________________________________________________________

batch size = 76
epochs = 5
loss = categorical_crossentropy
optimizer = adam

