Iteration 0
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1 (Conv2D)            (None, 28, 28, 1)         17        
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 28, 28, 1)         17        
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 28, 28, 1)         17        
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 28, 28, 1)         17        
_________________________________________________________________
flatten_1 (Flatten)          (None, 784)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 128)               100480    
_________________________________________________________________
dense_2 (Dense)              (None, 2)                 258       
=================================================================
Total params: 100,806
Trainable params: 100,806
Non-trainable params: 0
_________________________________________________________________

batch size = 109
epochs = 5
loss = categorical_crossentropy
optimizer = rmsprop

Iteration 1
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_5 (Conv2D)            (None, 28, 28, 3)         195       
_________________________________________________________________
conv2d_6 (Conv2D)            (None, 28, 28, 3)         579       
_________________________________________________________________
conv2d_7 (Conv2D)            (None, 28, 28, 3)         579       
_________________________________________________________________
conv2d_8 (Conv2D)            (None, 28, 28, 3)         579       
_________________________________________________________________
conv2d_9 (Conv2D)            (None, 28, 28, 3)         579       
_________________________________________________________________
conv2d_10 (Conv2D)           (None, 28, 28, 3)         579       
_________________________________________________________________
conv2d_11 (Conv2D)           (None, 28, 28, 3)         579       
_________________________________________________________________
conv2d_12 (Conv2D)           (None, 28, 28, 3)         579       
_________________________________________________________________
conv2d_13 (Conv2D)           (None, 28, 28, 3)         579       
_________________________________________________________________
flatten_2 (Flatten)          (None, 2352)              0         
_________________________________________________________________
dense_3 (Dense)              (None, 128)               301184    
_________________________________________________________________
dense_4 (Dense)              (None, 2)                 258       
=================================================================
Total params: 306,269
Trainable params: 306,269
Non-trainable params: 0
_________________________________________________________________

batch size = 121
epochs = 5
loss = categorical_crossentropy
optimizer = rmsprop

Iteration 2
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_14 (Conv2D)           (None, 28, 28, 3)         195       
_________________________________________________________________
flatten_3 (Flatten)          (None, 2352)              0         
_________________________________________________________________
dense_5 (Dense)              (None, 128)               301184    
_________________________________________________________________
dense_6 (Dense)              (None, 2)                 258       
=================================================================
Total params: 301,637
Trainable params: 301,637
Non-trainable params: 0
_________________________________________________________________

batch size = 88
epochs = 5
loss = categorical_crossentropy
optimizer = rmsprop

Iteration 3
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_15 (Conv2D)           (None, 28, 28, 4)         148       
_________________________________________________________________
conv2d_16 (Conv2D)           (None, 28, 28, 4)         580       
_________________________________________________________________
conv2d_17 (Conv2D)           (None, 28, 28, 4)         580       
_________________________________________________________________
conv2d_18 (Conv2D)           (None, 28, 28, 4)         580       
_________________________________________________________________
flatten_4 (Flatten)          (None, 3136)              0         
_________________________________________________________________
dense_7 (Dense)              (None, 128)               401536    
_________________________________________________________________
dense_8 (Dense)              (None, 2)                 258       
=================================================================
Total params: 403,682
Trainable params: 403,682
Non-trainable params: 0
_________________________________________________________________

batch size = 64
epochs = 5
loss = categorical_crossentropy
optimizer = rmsprop

Iteration 4
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_19 (Conv2D)           (None, 28, 28, 2)         4         
_________________________________________________________________
flatten_5 (Flatten)          (None, 1568)              0         
_________________________________________________________________
dense_9 (Dense)              (None, 128)               200832    
_________________________________________________________________
dense_10 (Dense)             (None, 2)                 258       
=================================================================
Total params: 201,094
Trainable params: 201,094
Non-trainable params: 0
_________________________________________________________________

batch size = 90
epochs = 5
loss = categorical_crossentropy
optimizer = rmsprop

Iteration 5
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_20 (Conv2D)           (None, 28, 28, 3)         30        
_________________________________________________________________
flatten_6 (Flatten)          (None, 2352)              0         
_________________________________________________________________
dense_11 (Dense)             (None, 128)               301184    
_________________________________________________________________
dense_12 (Dense)             (None, 2)                 258       
=================================================================
Total params: 301,472
Trainable params: 301,472
Non-trainable params: 0
_________________________________________________________________

batch size = 44
epochs = 5
loss = categorical_crossentropy
optimizer = rmsprop

Iteration 6
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_21 (Conv2D)           (None, 28, 28, 4)         104       
_________________________________________________________________
conv2d_22 (Conv2D)           (None, 28, 28, 4)         404       
_________________________________________________________________
conv2d_23 (Conv2D)           (None, 28, 28, 4)         404       
_________________________________________________________________
conv2d_24 (Conv2D)           (None, 28, 28, 4)         404       
_________________________________________________________________
flatten_7 (Flatten)          (None, 3136)              0         
_________________________________________________________________
dense_13 (Dense)             (None, 128)               401536    
_________________________________________________________________
dense_14 (Dense)             (None, 2)                 258       
=================================================================
Total params: 403,110
Trainable params: 403,110
Non-trainable params: 0
_________________________________________________________________

batch size = 113
epochs = 5
loss = categorical_crossentropy
optimizer = rmsprop

Iteration 7
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_25 (Conv2D)           (None, 28, 28, 3)         6         
_________________________________________________________________
conv2d_26 (Conv2D)           (None, 28, 28, 3)         12        
_________________________________________________________________
conv2d_27 (Conv2D)           (None, 28, 28, 3)         12        
_________________________________________________________________
conv2d_28 (Conv2D)           (None, 28, 28, 3)         12        
_________________________________________________________________
conv2d_29 (Conv2D)           (None, 28, 28, 3)         12        
_________________________________________________________________
flatten_8 (Flatten)          (None, 2352)              0         
_________________________________________________________________
dense_15 (Dense)             (None, 128)               301184    
_________________________________________________________________
dense_16 (Dense)             (None, 2)                 258       
=================================================================
Total params: 301,496
Trainable params: 301,496
Non-trainable params: 0
_________________________________________________________________

batch size = 74
epochs = 5
loss = categorical_crossentropy
optimizer = rmsprop

Iteration 8
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_30 (Conv2D)           (None, 28, 28, 4)         20        
_________________________________________________________________
conv2d_31 (Conv2D)           (None, 28, 28, 4)         68        
_________________________________________________________________
conv2d_32 (Conv2D)           (None, 28, 28, 4)         68        
_________________________________________________________________
conv2d_33 (Conv2D)           (None, 28, 28, 4)         68        
_________________________________________________________________
conv2d_34 (Conv2D)           (None, 28, 28, 4)         68        
_________________________________________________________________
conv2d_35 (Conv2D)           (None, 28, 28, 4)         68        
_________________________________________________________________
conv2d_36 (Conv2D)           (None, 28, 28, 4)         68        
_________________________________________________________________
flatten_9 (Flatten)          (None, 3136)              0         
_________________________________________________________________
dense_17 (Dense)             (None, 128)               401536    
_________________________________________________________________
dense_18 (Dense)             (None, 2)                 258       
=================================================================
Total params: 402,222
Trainable params: 402,222
Non-trainable params: 0
_________________________________________________________________

batch size = 105
epochs = 5
loss = categorical_crossentropy
optimizer = rmsprop

Iteration 9
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_37 (Conv2D)           (None, 28, 28, 1)         37        
_________________________________________________________________
conv2d_38 (Conv2D)           (None, 28, 28, 1)         37        
_________________________________________________________________
conv2d_39 (Conv2D)           (None, 28, 28, 1)         37        
_________________________________________________________________
conv2d_40 (Conv2D)           (None, 28, 28, 1)         37        
_________________________________________________________________
conv2d_41 (Conv2D)           (None, 28, 28, 1)         37        
_________________________________________________________________
conv2d_42 (Conv2D)           (None, 28, 28, 1)         37        
_________________________________________________________________
conv2d_43 (Conv2D)           (None, 28, 28, 1)         37        
_________________________________________________________________
conv2d_44 (Conv2D)           (None, 28, 28, 1)         37        
_________________________________________________________________
conv2d_45 (Conv2D)           (None, 28, 28, 1)         37        
_________________________________________________________________
flatten_10 (Flatten)         (None, 784)               0         
_________________________________________________________________
dense_19 (Dense)             (None, 128)               100480    
_________________________________________________________________
dense_20 (Dense)             (None, 2)                 258       
=================================================================
Total params: 101,071
Trainable params: 101,071
Non-trainable params: 0
_________________________________________________________________

batch size = 51
epochs = 5
loss = categorical_crossentropy
optimizer = rmsprop

