Iteration 0
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1 (Conv2D)            (None, 28, 28, 2)         20        
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 28, 28, 2)         38        
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 28, 28, 2)         38        
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 28, 28, 2)         38        
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 28, 28, 2)         38        
_________________________________________________________________
conv2d_6 (Conv2D)            (None, 28, 28, 2)         38        
_________________________________________________________________
flatten_1 (Flatten)          (None, 1568)              0         
_________________________________________________________________
dense_1 (Dense)              (None, 128)               200832    
_________________________________________________________________
dense_2 (Dense)              (None, 2)                 258       
=================================================================
Total params: 201,300
Trainable params: 201,300
Non-trainable params: 0
_________________________________________________________________

batch size = 82
epochs = 5
loss = categorical_crossentropy
optimizer = rmsprop

Iteration 1
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_7 (Conv2D)            (None, 28, 28, 1)         17        
_________________________________________________________________
conv2d_8 (Conv2D)            (None, 28, 28, 1)         17        
_________________________________________________________________
conv2d_9 (Conv2D)            (None, 28, 28, 1)         17        
_________________________________________________________________
conv2d_10 (Conv2D)           (None, 28, 28, 1)         17        
_________________________________________________________________
conv2d_11 (Conv2D)           (None, 28, 28, 1)         17        
_________________________________________________________________
conv2d_12 (Conv2D)           (None, 28, 28, 1)         17        
_________________________________________________________________
conv2d_13 (Conv2D)           (None, 28, 28, 1)         17        
_________________________________________________________________
conv2d_14 (Conv2D)           (None, 28, 28, 1)         17        
_________________________________________________________________
flatten_2 (Flatten)          (None, 784)               0         
_________________________________________________________________
dense_3 (Dense)              (None, 128)               100480    
_________________________________________________________________
dense_4 (Dense)              (None, 2)                 258       
=================================================================
Total params: 100,874
Trainable params: 100,874
Non-trainable params: 0
_________________________________________________________________

batch size = 91
epochs = 5
loss = categorical_crossentropy
optimizer = rmsprop

Iteration 2
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_15 (Conv2D)           (None, 28, 28, 2)         164       
_________________________________________________________________
conv2d_16 (Conv2D)           (None, 28, 28, 2)         326       
_________________________________________________________________
conv2d_17 (Conv2D)           (None, 28, 28, 2)         326       
_________________________________________________________________
conv2d_18 (Conv2D)           (None, 28, 28, 2)         326       
_________________________________________________________________
flatten_3 (Flatten)          (None, 1568)              0         
_________________________________________________________________
dense_5 (Dense)              (None, 128)               200832    
_________________________________________________________________
dense_6 (Dense)              (None, 2)                 258       
=================================================================
Total params: 202,232
Trainable params: 202,232
Non-trainable params: 0
_________________________________________________________________

batch size = 116
epochs = 5
loss = categorical_crossentropy
optimizer = rmsprop

Iteration 3
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_19 (Conv2D)           (None, 28, 28, 2)         130       
_________________________________________________________________
conv2d_20 (Conv2D)           (None, 28, 28, 2)         258       
_________________________________________________________________
conv2d_21 (Conv2D)           (None, 28, 28, 2)         258       
_________________________________________________________________
flatten_4 (Flatten)          (None, 1568)              0         
_________________________________________________________________
dense_7 (Dense)              (None, 128)               200832    
_________________________________________________________________
dense_8 (Dense)              (None, 2)                 258       
=================================================================
Total params: 201,736
Trainable params: 201,736
Non-trainable params: 0
_________________________________________________________________

batch size = 91
epochs = 5
loss = categorical_crossentropy
optimizer = rmsprop

Iteration 4
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_22 (Conv2D)           (None, 28, 28, 4)         104       
_________________________________________________________________
conv2d_23 (Conv2D)           (None, 28, 28, 4)         404       
_________________________________________________________________
conv2d_24 (Conv2D)           (None, 28, 28, 4)         404       
_________________________________________________________________
conv2d_25 (Conv2D)           (None, 28, 28, 4)         404       
_________________________________________________________________
conv2d_26 (Conv2D)           (None, 28, 28, 4)         404       
_________________________________________________________________
conv2d_27 (Conv2D)           (None, 28, 28, 4)         404       
_________________________________________________________________
flatten_5 (Flatten)          (None, 3136)              0         
_________________________________________________________________
dense_9 (Dense)              (None, 128)               401536    
_________________________________________________________________
dense_10 (Dense)             (None, 2)                 258       
=================================================================
Total params: 403,918
Trainable params: 403,918
Non-trainable params: 0
_________________________________________________________________

batch size = 122
epochs = 5
loss = categorical_crossentropy
optimizer = rmsprop

Iteration 5
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_28 (Conv2D)           (None, 28, 28, 2)         164       
_________________________________________________________________
conv2d_29 (Conv2D)           (None, 28, 28, 2)         326       
_________________________________________________________________
conv2d_30 (Conv2D)           (None, 28, 28, 2)         326       
_________________________________________________________________
conv2d_31 (Conv2D)           (None, 28, 28, 2)         326       
_________________________________________________________________
conv2d_32 (Conv2D)           (None, 28, 28, 2)         326       
_________________________________________________________________
conv2d_33 (Conv2D)           (None, 28, 28, 2)         326       
_________________________________________________________________
flatten_6 (Flatten)          (None, 1568)              0         
_________________________________________________________________
dense_11 (Dense)             (None, 128)               200832    
_________________________________________________________________
dense_12 (Dense)             (None, 2)                 258       
=================================================================
Total params: 202,884
Trainable params: 202,884
Non-trainable params: 0
_________________________________________________________________

batch size = 15
epochs = 5
loss = categorical_crossentropy
optimizer = rmsprop

Iteration 6
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_34 (Conv2D)           (None, 28, 28, 3)         78        
_________________________________________________________________
conv2d_35 (Conv2D)           (None, 28, 28, 3)         228       
_________________________________________________________________
conv2d_36 (Conv2D)           (None, 28, 28, 3)         228       
_________________________________________________________________
conv2d_37 (Conv2D)           (None, 28, 28, 3)         228       
_________________________________________________________________
conv2d_38 (Conv2D)           (None, 28, 28, 3)         228       
_________________________________________________________________
conv2d_39 (Conv2D)           (None, 28, 28, 3)         228       
_________________________________________________________________
conv2d_40 (Conv2D)           (None, 28, 28, 3)         228       
_________________________________________________________________
flatten_7 (Flatten)          (None, 2352)              0         
_________________________________________________________________
dense_13 (Dense)             (None, 128)               301184    
_________________________________________________________________
dense_14 (Dense)             (None, 2)                 258       
=================================================================
Total params: 302,888
Trainable params: 302,888
Non-trainable params: 0
_________________________________________________________________

batch size = 71
epochs = 5
loss = categorical_crossentropy
optimizer = rmsprop

Iteration 7
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_41 (Conv2D)           (None, 28, 28, 5)         250       
_________________________________________________________________
conv2d_42 (Conv2D)           (None, 28, 28, 5)         1230      
_________________________________________________________________
conv2d_43 (Conv2D)           (None, 28, 28, 5)         1230      
_________________________________________________________________
conv2d_44 (Conv2D)           (None, 28, 28, 5)         1230      
_________________________________________________________________
conv2d_45 (Conv2D)           (None, 28, 28, 5)         1230      
_________________________________________________________________
conv2d_46 (Conv2D)           (None, 28, 28, 5)         1230      
_________________________________________________________________
conv2d_47 (Conv2D)           (None, 28, 28, 5)         1230      
_________________________________________________________________
conv2d_48 (Conv2D)           (None, 28, 28, 5)         1230      
_________________________________________________________________
conv2d_49 (Conv2D)           (None, 28, 28, 5)         1230      
_________________________________________________________________
flatten_8 (Flatten)          (None, 3920)              0         
_________________________________________________________________
dense_15 (Dense)             (None, 128)               501888    
_________________________________________________________________
dense_16 (Dense)             (None, 2)                 258       
=================================================================
Total params: 512,236
Trainable params: 512,236
Non-trainable params: 0
_________________________________________________________________

batch size = 14
epochs = 5
loss = categorical_crossentropy
optimizer = rmsprop

Iteration 8
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_50 (Conv2D)           (None, 28, 28, 2)         164       
_________________________________________________________________
conv2d_51 (Conv2D)           (None, 28, 28, 2)         326       
_________________________________________________________________
conv2d_52 (Conv2D)           (None, 28, 28, 2)         326       
_________________________________________________________________
conv2d_53 (Conv2D)           (None, 28, 28, 2)         326       
_________________________________________________________________
conv2d_54 (Conv2D)           (None, 28, 28, 2)         326       
_________________________________________________________________
conv2d_55 (Conv2D)           (None, 28, 28, 2)         326       
_________________________________________________________________
conv2d_56 (Conv2D)           (None, 28, 28, 2)         326       
_________________________________________________________________
conv2d_57 (Conv2D)           (None, 28, 28, 2)         326       
_________________________________________________________________
conv2d_58 (Conv2D)           (None, 28, 28, 2)         326       
_________________________________________________________________
conv2d_59 (Conv2D)           (None, 28, 28, 2)         326       
_________________________________________________________________
flatten_9 (Flatten)          (None, 1568)              0         
_________________________________________________________________
dense_17 (Dense)             (None, 128)               200832    
_________________________________________________________________
dense_18 (Dense)             (None, 2)                 258       
=================================================================
Total params: 204,188
Trainable params: 204,188
Non-trainable params: 0
_________________________________________________________________

batch size = 60
epochs = 5
loss = categorical_crossentropy
optimizer = rmsprop

Iteration 9
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_60 (Conv2D)           (None, 28, 28, 3)         51        
_________________________________________________________________
conv2d_61 (Conv2D)           (None, 28, 28, 3)         147       
_________________________________________________________________
conv2d_62 (Conv2D)           (None, 28, 28, 3)         147       
_________________________________________________________________
conv2d_63 (Conv2D)           (None, 28, 28, 3)         147       
_________________________________________________________________
conv2d_64 (Conv2D)           (None, 28, 28, 3)         147       
_________________________________________________________________
conv2d_65 (Conv2D)           (None, 28, 28, 3)         147       
_________________________________________________________________
conv2d_66 (Conv2D)           (None, 28, 28, 3)         147       
_________________________________________________________________
flatten_10 (Flatten)         (None, 2352)              0         
_________________________________________________________________
dense_19 (Dense)             (None, 128)               301184    
_________________________________________________________________
dense_20 (Dense)             (None, 2)                 258       
=================================================================
Total params: 302,375
Trainable params: 302,375
Non-trainable params: 0
_________________________________________________________________

batch size = 99
epochs = 5
loss = categorical_crossentropy
optimizer = rmsprop

