Iteration 0
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
flatten_1 (Flatten)          (None, 784)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 4)                 3140      
_________________________________________________________________
dense_2 (Dense)              (None, 4)                 20        
_________________________________________________________________
dense_3 (Dense)              (None, 2)                 10        
=================================================================
Total params: 3,170
Trainable params: 3,170
Non-trainable params: 0
_________________________________________________________________

batch size = 108
epochs = 5
loss = categorical_crossentropy
optimizer = adam

Iteration 1
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
flatten_2 (Flatten)          (None, 784)               0         
_________________________________________________________________
dense_4 (Dense)              (None, 14)                10990     
_________________________________________________________________
dense_5 (Dense)              (None, 14)                210       
_________________________________________________________________
dense_6 (Dense)              (None, 14)                210       
_________________________________________________________________
dense_7 (Dense)              (None, 14)                210       
_________________________________________________________________
dense_8 (Dense)              (None, 14)                210       
_________________________________________________________________
dense_9 (Dense)              (None, 14)                210       
_________________________________________________________________
dense_10 (Dense)             (None, 14)                210       
_________________________________________________________________
dense_11 (Dense)             (None, 2)                 30        
=================================================================
Total params: 12,280
Trainable params: 12,280
Non-trainable params: 0
_________________________________________________________________

batch size = 119
epochs = 5
loss = categorical_crossentropy
optimizer = adam

Iteration 2
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
flatten_3 (Flatten)          (None, 784)               0         
_________________________________________________________________
dense_12 (Dense)             (None, 1)                 785       
_________________________________________________________________
dense_13 (Dense)             (None, 1)                 2         
_________________________________________________________________
dense_14 (Dense)             (None, 1)                 2         
_________________________________________________________________
dense_15 (Dense)             (None, 1)                 2         
_________________________________________________________________
dense_16 (Dense)             (None, 1)                 2         
_________________________________________________________________
dense_17 (Dense)             (None, 1)                 2         
_________________________________________________________________
dense_18 (Dense)             (None, 1)                 2         
_________________________________________________________________
dense_19 (Dense)             (None, 2)                 4         
=================================================================
Total params: 801
Trainable params: 801
Non-trainable params: 0
_________________________________________________________________

batch size = 75
epochs = 5
loss = categorical_crossentropy
optimizer = adam

Iteration 3
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
flatten_4 (Flatten)          (None, 784)               0         
_________________________________________________________________
dense_20 (Dense)             (None, 1)                 785       
_________________________________________________________________
dense_21 (Dense)             (None, 1)                 2         
_________________________________________________________________
dense_22 (Dense)             (None, 1)                 2         
_________________________________________________________________
dense_23 (Dense)             (None, 1)                 2         
_________________________________________________________________
dense_24 (Dense)             (None, 1)                 2         
_________________________________________________________________
dense_25 (Dense)             (None, 1)                 2         
_________________________________________________________________
dense_26 (Dense)             (None, 1)                 2         
_________________________________________________________________
dense_27 (Dense)             (None, 1)                 2         
_________________________________________________________________
dense_28 (Dense)             (None, 2)                 4         
=================================================================
Total params: 803
Trainable params: 803
Non-trainable params: 0
_________________________________________________________________

batch size = 39
epochs = 5
loss = categorical_crossentropy
optimizer = adam

Iteration 4
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
flatten_5 (Flatten)          (None, 784)               0         
_________________________________________________________________
dense_29 (Dense)             (None, 10)                7850      
_________________________________________________________________
dense_30 (Dense)             (None, 10)                110       
_________________________________________________________________
dense_31 (Dense)             (None, 2)                 22        
=================================================================
Total params: 7,982
Trainable params: 7,982
Non-trainable params: 0
_________________________________________________________________

batch size = 39
epochs = 5
loss = categorical_crossentropy
optimizer = adam

Iteration 5
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
flatten_6 (Flatten)          (None, 784)               0         
_________________________________________________________________
dense_32 (Dense)             (None, 9)                 7065      
_________________________________________________________________
dense_33 (Dense)             (None, 9)                 90        
_________________________________________________________________
dense_34 (Dense)             (None, 9)                 90        
_________________________________________________________________
dense_35 (Dense)             (None, 9)                 90        
_________________________________________________________________
dense_36 (Dense)             (None, 9)                 90        
_________________________________________________________________
dense_37 (Dense)             (None, 9)                 90        
_________________________________________________________________
dense_38 (Dense)             (None, 9)                 90        
_________________________________________________________________
dense_39 (Dense)             (None, 2)                 20        
=================================================================
Total params: 7,625
Trainable params: 7,625
Non-trainable params: 0
_________________________________________________________________

batch size = 32
epochs = 5
loss = categorical_crossentropy
optimizer = adam

Iteration 6
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
flatten_7 (Flatten)          (None, 784)               0         
_________________________________________________________________
dense_40 (Dense)             (None, 2)                 1570      
_________________________________________________________________
dense_41 (Dense)             (None, 2)                 6         
_________________________________________________________________
dense_42 (Dense)             (None, 2)                 6         
_________________________________________________________________
dense_43 (Dense)             (None, 2)                 6         
_________________________________________________________________
dense_44 (Dense)             (None, 2)                 6         
_________________________________________________________________
dense_45 (Dense)             (None, 2)                 6         
_________________________________________________________________
dense_46 (Dense)             (None, 2)                 6         
_________________________________________________________________
dense_47 (Dense)             (None, 2)                 6         
=================================================================
Total params: 1,612
Trainable params: 1,612
Non-trainable params: 0
_________________________________________________________________

batch size = 10
epochs = 5
loss = categorical_crossentropy
optimizer = adam

Iteration 7
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
flatten_8 (Flatten)          (None, 784)               0         
_________________________________________________________________
dense_48 (Dense)             (None, 1)                 785       
_________________________________________________________________
dense_49 (Dense)             (None, 1)                 2         
_________________________________________________________________
dense_50 (Dense)             (None, 1)                 2         
_________________________________________________________________
dense_51 (Dense)             (None, 2)                 4         
=================================================================
Total params: 793
Trainable params: 793
Non-trainable params: 0
_________________________________________________________________

batch size = 16
epochs = 5
loss = categorical_crossentropy
optimizer = adam

Iteration 8
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
flatten_9 (Flatten)          (None, 784)               0         
_________________________________________________________________
dense_52 (Dense)             (None, 12)                9420      
_________________________________________________________________
dense_53 (Dense)             (None, 12)                156       
_________________________________________________________________
dense_54 (Dense)             (None, 12)                156       
_________________________________________________________________
dense_55 (Dense)             (None, 12)                156       
_________________________________________________________________
dense_56 (Dense)             (None, 12)                156       
_________________________________________________________________
dense_57 (Dense)             (None, 12)                156       
_________________________________________________________________
dense_58 (Dense)             (None, 12)                156       
_________________________________________________________________
dense_59 (Dense)             (None, 12)                156       
_________________________________________________________________
dense_60 (Dense)             (None, 2)                 26        
=================================================================
Total params: 10,538
Trainable params: 10,538
Non-trainable params: 0
_________________________________________________________________

batch size = 17
epochs = 5
loss = categorical_crossentropy
optimizer = adam

Iteration 9
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
flatten_10 (Flatten)         (None, 784)               0         
_________________________________________________________________
dense_61 (Dense)             (None, 6)                 4710      
_________________________________________________________________
dense_62 (Dense)             (None, 2)                 14        
=================================================================
Total params: 4,724
Trainable params: 4,724
Non-trainable params: 0
_________________________________________________________________

batch size = 4
epochs = 5
loss = categorical_crossentropy
optimizer = adam

