Iteration 0
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1 (Conv2D)            (None, 28, 28, 3)         6         
_________________________________________________________________
flatten_1 (Flatten)          (None, 2352)              0         
_________________________________________________________________
dense_1 (Dense)              (None, 128)               301184    
_________________________________________________________________
dense_2 (Dense)              (None, 2)                 258       
=================================================================
Total params: 301,448
Trainable params: 301,448
Non-trainable params: 0
_________________________________________________________________

batch size = 13
epochs = 5
loss = categorical_crossentropy
optimizer = rmsprop

Iteration 1
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_2 (Conv2D)            (None, 28, 28, 4)         8         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 28, 28, 4)         20        
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 28, 28, 4)         20        
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 28, 28, 4)         20        
_________________________________________________________________
conv2d_6 (Conv2D)            (None, 28, 28, 4)         20        
_________________________________________________________________
conv2d_7 (Conv2D)            (None, 28, 28, 4)         20        
_________________________________________________________________
conv2d_8 (Conv2D)            (None, 28, 28, 4)         20        
_________________________________________________________________
conv2d_9 (Conv2D)            (None, 28, 28, 4)         20        
_________________________________________________________________
flatten_2 (Flatten)          (None, 3136)              0         
_________________________________________________________________
dense_3 (Dense)              (None, 128)               401536    
_________________________________________________________________
dense_4 (Dense)              (None, 2)                 258       
=================================================================
Total params: 401,942
Trainable params: 401,942
Non-trainable params: 0
_________________________________________________________________

batch size = 3
epochs = 5
loss = categorical_crossentropy
optimizer = rmsprop

Iteration 2
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_10 (Conv2D)           (None, 28, 28, 5)         505       
_________________________________________________________________
conv2d_11 (Conv2D)           (None, 28, 28, 5)         2505      
_________________________________________________________________
conv2d_12 (Conv2D)           (None, 28, 28, 5)         2505      
_________________________________________________________________
conv2d_13 (Conv2D)           (None, 28, 28, 5)         2505      
_________________________________________________________________
conv2d_14 (Conv2D)           (None, 28, 28, 5)         2505      
_________________________________________________________________
conv2d_15 (Conv2D)           (None, 28, 28, 5)         2505      
_________________________________________________________________
conv2d_16 (Conv2D)           (None, 28, 28, 5)         2505      
_________________________________________________________________
conv2d_17 (Conv2D)           (None, 28, 28, 5)         2505      
_________________________________________________________________
flatten_3 (Flatten)          (None, 3920)              0         
_________________________________________________________________
dense_5 (Dense)              (None, 128)               501888    
_________________________________________________________________
dense_6 (Dense)              (None, 2)                 258       
=================================================================
Total params: 520,186
Trainable params: 520,186
Non-trainable params: 0
_________________________________________________________________

batch size = 43
epochs = 5
loss = categorical_crossentropy
optimizer = rmsprop

Iteration 3
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_18 (Conv2D)           (None, 28, 28, 5)         185       
_________________________________________________________________
conv2d_19 (Conv2D)           (None, 28, 28, 5)         905       
_________________________________________________________________
conv2d_20 (Conv2D)           (None, 28, 28, 5)         905       
_________________________________________________________________
conv2d_21 (Conv2D)           (None, 28, 28, 5)         905       
_________________________________________________________________
conv2d_22 (Conv2D)           (None, 28, 28, 5)         905       
_________________________________________________________________
conv2d_23 (Conv2D)           (None, 28, 28, 5)         905       
_________________________________________________________________
flatten_4 (Flatten)          (None, 3920)              0         
_________________________________________________________________
dense_7 (Dense)              (None, 128)               501888    
_________________________________________________________________
dense_8 (Dense)              (None, 2)                 258       
=================================================================
Total params: 506,856
Trainable params: 506,856
Non-trainable params: 0
_________________________________________________________________

batch size = 57
epochs = 5
loss = categorical_crossentropy
optimizer = rmsprop

Iteration 4
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_24 (Conv2D)           (None, 28, 28, 3)         30        
_________________________________________________________________
conv2d_25 (Conv2D)           (None, 28, 28, 3)         84        
_________________________________________________________________
conv2d_26 (Conv2D)           (None, 28, 28, 3)         84        
_________________________________________________________________
conv2d_27 (Conv2D)           (None, 28, 28, 3)         84        
_________________________________________________________________
conv2d_28 (Conv2D)           (None, 28, 28, 3)         84        
_________________________________________________________________
conv2d_29 (Conv2D)           (None, 28, 28, 3)         84        
_________________________________________________________________
conv2d_30 (Conv2D)           (None, 28, 28, 3)         84        
_________________________________________________________________
flatten_5 (Flatten)          (None, 2352)              0         
_________________________________________________________________
dense_9 (Dense)              (None, 128)               301184    
_________________________________________________________________
dense_10 (Dense)             (None, 2)                 258       
=================================================================
Total params: 301,976
Trainable params: 301,976
Non-trainable params: 0
_________________________________________________________________

batch size = 44
epochs = 5
loss = categorical_crossentropy
optimizer = rmsprop

Iteration 5
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_31 (Conv2D)           (None, 28, 28, 3)         195       
_________________________________________________________________
conv2d_32 (Conv2D)           (None, 28, 28, 3)         579       
_________________________________________________________________
conv2d_33 (Conv2D)           (None, 28, 28, 3)         579       
_________________________________________________________________
flatten_6 (Flatten)          (None, 2352)              0         
_________________________________________________________________
dense_11 (Dense)             (None, 128)               301184    
_________________________________________________________________
dense_12 (Dense)             (None, 2)                 258       
=================================================================
Total params: 302,795
Trainable params: 302,795
Non-trainable params: 0
_________________________________________________________________

batch size = 14
epochs = 5
loss = categorical_crossentropy
optimizer = rmsprop

Iteration 6
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_34 (Conv2D)           (None, 28, 28, 3)         51        
_________________________________________________________________
conv2d_35 (Conv2D)           (None, 28, 28, 3)         147       
_________________________________________________________________
conv2d_36 (Conv2D)           (None, 28, 28, 3)         147       
_________________________________________________________________
conv2d_37 (Conv2D)           (None, 28, 28, 3)         147       
_________________________________________________________________
conv2d_38 (Conv2D)           (None, 28, 28, 3)         147       
_________________________________________________________________
conv2d_39 (Conv2D)           (None, 28, 28, 3)         147       
_________________________________________________________________
conv2d_40 (Conv2D)           (None, 28, 28, 3)         147       
_________________________________________________________________
flatten_7 (Flatten)          (None, 2352)              0         
_________________________________________________________________
dense_13 (Dense)             (None, 128)               301184    
_________________________________________________________________
dense_14 (Dense)             (None, 2)                 258       
=================================================================
Total params: 302,375
Trainable params: 302,375
Non-trainable params: 0
_________________________________________________________________

batch size = 34
epochs = 5
loss = categorical_crossentropy
optimizer = rmsprop

Iteration 7
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_41 (Conv2D)           (None, 28, 28, 4)         260       
_________________________________________________________________
conv2d_42 (Conv2D)           (None, 28, 28, 4)         1028      
_________________________________________________________________
conv2d_43 (Conv2D)           (None, 28, 28, 4)         1028      
_________________________________________________________________
conv2d_44 (Conv2D)           (None, 28, 28, 4)         1028      
_________________________________________________________________
conv2d_45 (Conv2D)           (None, 28, 28, 4)         1028      
_________________________________________________________________
conv2d_46 (Conv2D)           (None, 28, 28, 4)         1028      
_________________________________________________________________
conv2d_47 (Conv2D)           (None, 28, 28, 4)         1028      
_________________________________________________________________
conv2d_48 (Conv2D)           (None, 28, 28, 4)         1028      
_________________________________________________________________
conv2d_49 (Conv2D)           (None, 28, 28, 4)         1028      
_________________________________________________________________
conv2d_50 (Conv2D)           (None, 28, 28, 4)         1028      
_________________________________________________________________
flatten_8 (Flatten)          (None, 3136)              0         
_________________________________________________________________
dense_15 (Dense)             (None, 128)               401536    
_________________________________________________________________
dense_16 (Dense)             (None, 2)                 258       
=================================================================
Total params: 411,306
Trainable params: 411,306
Non-trainable params: 0
_________________________________________________________________

batch size = 12
epochs = 5
loss = categorical_crossentropy
optimizer = rmsprop

Iteration 8
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_51 (Conv2D)           (None, 28, 28, 5)         250       
_________________________________________________________________
conv2d_52 (Conv2D)           (None, 28, 28, 5)         1230      
_________________________________________________________________
conv2d_53 (Conv2D)           (None, 28, 28, 5)         1230      
_________________________________________________________________
conv2d_54 (Conv2D)           (None, 28, 28, 5)         1230      
_________________________________________________________________
conv2d_55 (Conv2D)           (None, 28, 28, 5)         1230      
_________________________________________________________________
conv2d_56 (Conv2D)           (None, 28, 28, 5)         1230      
_________________________________________________________________
conv2d_57 (Conv2D)           (None, 28, 28, 5)         1230      
_________________________________________________________________
flatten_9 (Flatten)          (None, 3920)              0         
_________________________________________________________________
dense_17 (Dense)             (None, 128)               501888    
_________________________________________________________________
dense_18 (Dense)             (None, 2)                 258       
=================================================================
Total params: 509,776
Trainable params: 509,776
Non-trainable params: 0
_________________________________________________________________

batch size = 124
epochs = 5
loss = categorical_crossentropy
optimizer = rmsprop

Iteration 9
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_58 (Conv2D)           (None, 28, 28, 1)         17        
_________________________________________________________________
conv2d_59 (Conv2D)           (None, 28, 28, 1)         17        
_________________________________________________________________
flatten_10 (Flatten)         (None, 784)               0         
_________________________________________________________________
dense_19 (Dense)             (None, 128)               100480    
_________________________________________________________________
dense_20 (Dense)             (None, 2)                 258       
=================================================================
Total params: 100,772
Trainable params: 100,772
Non-trainable params: 0
_________________________________________________________________

batch size = 101
epochs = 5
loss = categorical_crossentropy
optimizer = rmsprop

