Iteration 0
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
flatten_1 (Flatten)          (None, 784)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 12)                9420      
_________________________________________________________________
dense_2 (Dense)              (None, 12)                156       
_________________________________________________________________
dense_3 (Dense)              (None, 12)                156       
_________________________________________________________________
dense_4 (Dense)              (None, 12)                156       
_________________________________________________________________
dense_5 (Dense)              (None, 12)                156       
_________________________________________________________________
dense_6 (Dense)              (None, 12)                156       
_________________________________________________________________
dense_7 (Dense)              (None, 12)                156       
_________________________________________________________________
dense_8 (Dense)              (None, 12)                156       
_________________________________________________________________
dense_9 (Dense)              (None, 2)                 26        
=================================================================
Total params: 10,538
Trainable params: 10,538
Non-trainable params: 0
_________________________________________________________________

batch size = 7
epochs = 5
loss = categorical_crossentropy
optimizer = adam

Iteration 1
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
flatten_2 (Flatten)          (None, 784)               0         
_________________________________________________________________
dense_10 (Dense)             (None, 9)                 7065      
_________________________________________________________________
dense_11 (Dense)             (None, 9)                 90        
_________________________________________________________________
dense_12 (Dense)             (None, 9)                 90        
_________________________________________________________________
dense_13 (Dense)             (None, 9)                 90        
_________________________________________________________________
dense_14 (Dense)             (None, 2)                 20        
=================================================================
Total params: 7,355
Trainable params: 7,355
Non-trainable params: 0
_________________________________________________________________

batch size = 42
epochs = 5
loss = categorical_crossentropy
optimizer = adam

Iteration 2
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
flatten_3 (Flatten)          (None, 784)               0         
_________________________________________________________________
dense_15 (Dense)             (None, 6)                 4710      
_________________________________________________________________
dense_16 (Dense)             (None, 6)                 42        
_________________________________________________________________
dense_17 (Dense)             (None, 6)                 42        
_________________________________________________________________
dense_18 (Dense)             (None, 2)                 14        
=================================================================
Total params: 4,808
Trainable params: 4,808
Non-trainable params: 0
_________________________________________________________________

batch size = 74
epochs = 5
loss = categorical_crossentropy
optimizer = adam

Iteration 3
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
flatten_4 (Flatten)          (None, 784)               0         
_________________________________________________________________
dense_19 (Dense)             (None, 14)                10990     
_________________________________________________________________
dense_20 (Dense)             (None, 14)                210       
_________________________________________________________________
dense_21 (Dense)             (None, 14)                210       
_________________________________________________________________
dense_22 (Dense)             (None, 14)                210       
_________________________________________________________________
dense_23 (Dense)             (None, 14)                210       
_________________________________________________________________
dense_24 (Dense)             (None, 14)                210       
_________________________________________________________________
dense_25 (Dense)             (None, 14)                210       
_________________________________________________________________
dense_26 (Dense)             (None, 14)                210       
_________________________________________________________________
dense_27 (Dense)             (None, 2)                 30        
=================================================================
Total params: 12,490
Trainable params: 12,490
Non-trainable params: 0
_________________________________________________________________

batch size = 37
epochs = 5
loss = categorical_crossentropy
optimizer = adam

Iteration 4
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
flatten_5 (Flatten)          (None, 784)               0         
_________________________________________________________________
dense_28 (Dense)             (None, 10)                7850      
_________________________________________________________________
dense_29 (Dense)             (None, 10)                110       
_________________________________________________________________
dense_30 (Dense)             (None, 10)                110       
_________________________________________________________________
dense_31 (Dense)             (None, 10)                110       
_________________________________________________________________
dense_32 (Dense)             (None, 10)                110       
_________________________________________________________________
dense_33 (Dense)             (None, 10)                110       
_________________________________________________________________
dense_34 (Dense)             (None, 10)                110       
_________________________________________________________________
dense_35 (Dense)             (None, 10)                110       
_________________________________________________________________
dense_36 (Dense)             (None, 2)                 22        
=================================================================
Total params: 8,642
Trainable params: 8,642
Non-trainable params: 0
_________________________________________________________________

batch size = 30
epochs = 5
loss = categorical_crossentropy
optimizer = adam

Iteration 5
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
flatten_6 (Flatten)          (None, 784)               0         
_________________________________________________________________
dense_37 (Dense)             (None, 6)                 4710      
_________________________________________________________________
dense_38 (Dense)             (None, 6)                 42        
_________________________________________________________________
dense_39 (Dense)             (None, 2)                 14        
=================================================================
Total params: 4,766
Trainable params: 4,766
Non-trainable params: 0
_________________________________________________________________

batch size = 97
epochs = 5
loss = categorical_crossentropy
optimizer = adam

Iteration 6
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
flatten_7 (Flatten)          (None, 784)               0         
_________________________________________________________________
dense_40 (Dense)             (None, 17)                13345     
_________________________________________________________________
dense_41 (Dense)             (None, 17)                306       
_________________________________________________________________
dense_42 (Dense)             (None, 2)                 36        
=================================================================
Total params: 13,687
Trainable params: 13,687
Non-trainable params: 0
_________________________________________________________________

batch size = 100
epochs = 5
loss = categorical_crossentropy
optimizer = adam

Iteration 7
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
flatten_8 (Flatten)          (None, 784)               0         
_________________________________________________________________
dense_43 (Dense)             (None, 17)                13345     
_________________________________________________________________
dense_44 (Dense)             (None, 17)                306       
_________________________________________________________________
dense_45 (Dense)             (None, 17)                306       
_________________________________________________________________
dense_46 (Dense)             (None, 17)                306       
_________________________________________________________________
dense_47 (Dense)             (None, 2)                 36        
=================================================================
Total params: 14,299
Trainable params: 14,299
Non-trainable params: 0
_________________________________________________________________

batch size = 109
epochs = 5
loss = categorical_crossentropy
optimizer = adam

Iteration 8
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
flatten_9 (Flatten)          (None, 784)               0         
_________________________________________________________________
dense_48 (Dense)             (None, 13)                10205     
_________________________________________________________________
dense_49 (Dense)             (None, 13)                182       
_________________________________________________________________
dense_50 (Dense)             (None, 13)                182       
_________________________________________________________________
dense_51 (Dense)             (None, 13)                182       
_________________________________________________________________
dense_52 (Dense)             (None, 13)                182       
_________________________________________________________________
dense_53 (Dense)             (None, 13)                182       
_________________________________________________________________
dense_54 (Dense)             (None, 13)                182       
_________________________________________________________________
dense_55 (Dense)             (None, 13)                182       
_________________________________________________________________
dense_56 (Dense)             (None, 13)                182       
_________________________________________________________________
dense_57 (Dense)             (None, 13)                182       
_________________________________________________________________
dense_58 (Dense)             (None, 2)                 28        
=================================================================
Total params: 11,871
Trainable params: 11,871
Non-trainable params: 0
_________________________________________________________________

batch size = 22
epochs = 5
loss = categorical_crossentropy
optimizer = adam

Iteration 9
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
flatten_10 (Flatten)         (None, 784)               0         
_________________________________________________________________
dense_59 (Dense)             (None, 8)                 6280      
_________________________________________________________________
dense_60 (Dense)             (None, 8)                 72        
_________________________________________________________________
dense_61 (Dense)             (None, 8)                 72        
_________________________________________________________________
dense_62 (Dense)             (None, 8)                 72        
_________________________________________________________________
dense_63 (Dense)             (None, 8)                 72        
_________________________________________________________________
dense_64 (Dense)             (None, 8)                 72        
_________________________________________________________________
dense_65 (Dense)             (None, 8)                 72        
_________________________________________________________________
dense_66 (Dense)             (None, 8)                 72        
_________________________________________________________________
dense_67 (Dense)             (None, 8)                 72        
_________________________________________________________________
dense_68 (Dense)             (None, 2)                 18        
=================================================================
Total params: 6,874
Trainable params: 6,874
Non-trainable params: 0
_________________________________________________________________

batch size = 113
epochs = 5
loss = categorical_crossentropy
optimizer = adam

