Iteration 0
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
flatten_1 (Flatten)          (None, 784)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 15)                11775     
_________________________________________________________________
dense_2 (Dense)              (None, 15)                240       
_________________________________________________________________
dense_3 (Dense)              (None, 15)                240       
_________________________________________________________________
dense_4 (Dense)              (None, 15)                240       
_________________________________________________________________
dense_5 (Dense)              (None, 15)                240       
_________________________________________________________________
dense_6 (Dense)              (None, 15)                240       
_________________________________________________________________
dense_7 (Dense)              (None, 15)                240       
_________________________________________________________________
dense_8 (Dense)              (None, 15)                240       
_________________________________________________________________
dense_9 (Dense)              (None, 15)                240       
_________________________________________________________________
dense_10 (Dense)             (None, 2)                 32        
=================================================================
Total params: 13,727
Trainable params: 13,727
Non-trainable params: 0
_________________________________________________________________

batch size = 99
epochs = 5
loss = categorical_crossentropy
optimizer = adam

Iteration 1
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
flatten_2 (Flatten)          (None, 784)               0         
_________________________________________________________________
dense_11 (Dense)             (None, 10)                7850      
_________________________________________________________________
dense_12 (Dense)             (None, 10)                110       
_________________________________________________________________
dense_13 (Dense)             (None, 10)                110       
_________________________________________________________________
dense_14 (Dense)             (None, 10)                110       
_________________________________________________________________
dense_15 (Dense)             (None, 10)                110       
_________________________________________________________________
dense_16 (Dense)             (None, 2)                 22        
=================================================================
Total params: 8,312
Trainable params: 8,312
Non-trainable params: 0
_________________________________________________________________

batch size = 109
epochs = 5
loss = categorical_crossentropy
optimizer = adam

Iteration 2
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
flatten_3 (Flatten)          (None, 784)               0         
_________________________________________________________________
dense_17 (Dense)             (None, 20)                15700     
_________________________________________________________________
dense_18 (Dense)             (None, 20)                420       
_________________________________________________________________
dense_19 (Dense)             (None, 20)                420       
_________________________________________________________________
dense_20 (Dense)             (None, 20)                420       
_________________________________________________________________
dense_21 (Dense)             (None, 2)                 42        
=================================================================
Total params: 17,002
Trainable params: 17,002
Non-trainable params: 0
_________________________________________________________________

batch size = 93
epochs = 5
loss = categorical_crossentropy
optimizer = adam

Iteration 3
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
flatten_4 (Flatten)          (None, 784)               0         
_________________________________________________________________
dense_22 (Dense)             (None, 11)                8635      
_________________________________________________________________
dense_23 (Dense)             (None, 11)                132       
_________________________________________________________________
dense_24 (Dense)             (None, 11)                132       
_________________________________________________________________
dense_25 (Dense)             (None, 11)                132       
_________________________________________________________________
dense_26 (Dense)             (None, 11)                132       
_________________________________________________________________
dense_27 (Dense)             (None, 11)                132       
_________________________________________________________________
dense_28 (Dense)             (None, 11)                132       
_________________________________________________________________
dense_29 (Dense)             (None, 2)                 24        
=================================================================
Total params: 9,451
Trainable params: 9,451
Non-trainable params: 0
_________________________________________________________________

batch size = 82
epochs = 5
loss = categorical_crossentropy
optimizer = adam

Iteration 4
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
flatten_5 (Flatten)          (None, 784)               0         
_________________________________________________________________
dense_30 (Dense)             (None, 18)                14130     
_________________________________________________________________
dense_31 (Dense)             (None, 18)                342       
_________________________________________________________________
dense_32 (Dense)             (None, 18)                342       
_________________________________________________________________
dense_33 (Dense)             (None, 18)                342       
_________________________________________________________________
dense_34 (Dense)             (None, 18)                342       
_________________________________________________________________
dense_35 (Dense)             (None, 18)                342       
_________________________________________________________________
dense_36 (Dense)             (None, 18)                342       
_________________________________________________________________
dense_37 (Dense)             (None, 2)                 38        
=================================================================
Total params: 16,220
Trainable params: 16,220
Non-trainable params: 0
_________________________________________________________________

batch size = 122
epochs = 5
loss = categorical_crossentropy
optimizer = adam

Iteration 5
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
flatten_6 (Flatten)          (None, 784)               0         
_________________________________________________________________
dense_38 (Dense)             (None, 19)                14915     
_________________________________________________________________
dense_39 (Dense)             (None, 19)                380       
_________________________________________________________________
dense_40 (Dense)             (None, 19)                380       
_________________________________________________________________
dense_41 (Dense)             (None, 2)                 40        
=================================================================
Total params: 15,715
Trainable params: 15,715
Non-trainable params: 0
_________________________________________________________________

batch size = 116
epochs = 5
loss = categorical_crossentropy
optimizer = adam

Iteration 6
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
flatten_7 (Flatten)          (None, 784)               0         
_________________________________________________________________
dense_42 (Dense)             (None, 10)                7850      
_________________________________________________________________
dense_43 (Dense)             (None, 10)                110       
_________________________________________________________________
dense_44 (Dense)             (None, 10)                110       
_________________________________________________________________
dense_45 (Dense)             (None, 10)                110       
_________________________________________________________________
dense_46 (Dense)             (None, 10)                110       
_________________________________________________________________
dense_47 (Dense)             (None, 10)                110       
_________________________________________________________________
dense_48 (Dense)             (None, 10)                110       
_________________________________________________________________
dense_49 (Dense)             (None, 10)                110       
_________________________________________________________________
dense_50 (Dense)             (None, 10)                110       
_________________________________________________________________
dense_51 (Dense)             (None, 2)                 22        
=================================================================
Total params: 8,752
Trainable params: 8,752
Non-trainable params: 0
_________________________________________________________________

batch size = 119
epochs = 5
loss = categorical_crossentropy
optimizer = adam

Iteration 7
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
flatten_8 (Flatten)          (None, 784)               0         
_________________________________________________________________
dense_52 (Dense)             (None, 7)                 5495      
_________________________________________________________________
dense_53 (Dense)             (None, 2)                 16        
=================================================================
Total params: 5,511
Trainable params: 5,511
Non-trainable params: 0
_________________________________________________________________

batch size = 120
epochs = 5
loss = categorical_crossentropy
optimizer = adam

Iteration 8
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
flatten_9 (Flatten)          (None, 784)               0         
_________________________________________________________________
dense_54 (Dense)             (None, 15)                11775     
_________________________________________________________________
dense_55 (Dense)             (None, 15)                240       
_________________________________________________________________
dense_56 (Dense)             (None, 2)                 32        
=================================================================
Total params: 12,047
Trainable params: 12,047
Non-trainable params: 0
_________________________________________________________________

batch size = 80
epochs = 5
loss = categorical_crossentropy
optimizer = adam

Iteration 9
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
flatten_10 (Flatten)         (None, 784)               0         
_________________________________________________________________
dense_57 (Dense)             (None, 11)                8635      
_________________________________________________________________
dense_58 (Dense)             (None, 11)                132       
_________________________________________________________________
dense_59 (Dense)             (None, 11)                132       
_________________________________________________________________
dense_60 (Dense)             (None, 11)                132       
_________________________________________________________________
dense_61 (Dense)             (None, 2)                 24        
=================================================================
Total params: 9,055
Trainable params: 9,055
Non-trainable params: 0
_________________________________________________________________

batch size = 120
epochs = 5
loss = categorical_crossentropy
optimizer = adam

