Iteration 0
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
flatten_1 (Flatten)          (None, 784)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 8)                 6280      
_________________________________________________________________
dense_2 (Dense)              (None, 8)                 72        
_________________________________________________________________
dense_3 (Dense)              (None, 8)                 72        
_________________________________________________________________
dense_4 (Dense)              (None, 8)                 72        
_________________________________________________________________
dense_5 (Dense)              (None, 8)                 72        
_________________________________________________________________
dense_6 (Dense)              (None, 8)                 72        
_________________________________________________________________
dense_7 (Dense)              (None, 8)                 72        
_________________________________________________________________
dense_8 (Dense)              (None, 8)                 72        
_________________________________________________________________
dense_9 (Dense)              (None, 2)                 18        
=================================================================
Total params: 6,802
Trainable params: 6,802
Non-trainable params: 0
_________________________________________________________________

batch size = 18
epochs = 5
loss = categorical_crossentropy
optimizer = adam

Iteration 1
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
flatten_2 (Flatten)          (None, 784)               0         
_________________________________________________________________
dense_10 (Dense)             (None, 8)                 6280      
_________________________________________________________________
dense_11 (Dense)             (None, 8)                 72        
_________________________________________________________________
dense_12 (Dense)             (None, 8)                 72        
_________________________________________________________________
dense_13 (Dense)             (None, 8)                 72        
_________________________________________________________________
dense_14 (Dense)             (None, 8)                 72        
_________________________________________________________________
dense_15 (Dense)             (None, 8)                 72        
_________________________________________________________________
dense_16 (Dense)             (None, 8)                 72        
_________________________________________________________________
dense_17 (Dense)             (None, 2)                 18        
=================================================================
Total params: 6,730
Trainable params: 6,730
Non-trainable params: 0
_________________________________________________________________

batch size = 90
epochs = 5
loss = categorical_crossentropy
optimizer = adam

Iteration 2
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
flatten_3 (Flatten)          (None, 784)               0         
_________________________________________________________________
dense_18 (Dense)             (None, 6)                 4710      
_________________________________________________________________
dense_19 (Dense)             (None, 6)                 42        
_________________________________________________________________
dense_20 (Dense)             (None, 6)                 42        
_________________________________________________________________
dense_21 (Dense)             (None, 6)                 42        
_________________________________________________________________
dense_22 (Dense)             (None, 6)                 42        
_________________________________________________________________
dense_23 (Dense)             (None, 6)                 42        
_________________________________________________________________
dense_24 (Dense)             (None, 6)                 42        
_________________________________________________________________
dense_25 (Dense)             (None, 6)                 42        
_________________________________________________________________
dense_26 (Dense)             (None, 6)                 42        
_________________________________________________________________
dense_27 (Dense)             (None, 2)                 14        
=================================================================
Total params: 5,060
Trainable params: 5,060
Non-trainable params: 0
_________________________________________________________________

batch size = 3
epochs = 5
loss = categorical_crossentropy
optimizer = adam

Iteration 3
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
flatten_4 (Flatten)          (None, 784)               0         
_________________________________________________________________
dense_28 (Dense)             (None, 6)                 4710      
_________________________________________________________________
dense_29 (Dense)             (None, 6)                 42        
_________________________________________________________________
dense_30 (Dense)             (None, 6)                 42        
_________________________________________________________________
dense_31 (Dense)             (None, 6)                 42        
_________________________________________________________________
dense_32 (Dense)             (None, 2)                 14        
=================================================================
Total params: 4,850
Trainable params: 4,850
Non-trainable params: 0
_________________________________________________________________

batch size = 15
epochs = 5
loss = categorical_crossentropy
optimizer = adam

Iteration 4
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
flatten_5 (Flatten)          (None, 784)               0         
_________________________________________________________________
dense_33 (Dense)             (None, 12)                9420      
_________________________________________________________________
dense_34 (Dense)             (None, 12)                156       
_________________________________________________________________
dense_35 (Dense)             (None, 12)                156       
_________________________________________________________________
dense_36 (Dense)             (None, 12)                156       
_________________________________________________________________
dense_37 (Dense)             (None, 12)                156       
_________________________________________________________________
dense_38 (Dense)             (None, 12)                156       
_________________________________________________________________
dense_39 (Dense)             (None, 12)                156       
_________________________________________________________________
dense_40 (Dense)             (None, 12)                156       
_________________________________________________________________
dense_41 (Dense)             (None, 12)                156       
_________________________________________________________________
dense_42 (Dense)             (None, 12)                156       
_________________________________________________________________
dense_43 (Dense)             (None, 2)                 26        
=================================================================
Total params: 10,850
Trainable params: 10,850
Non-trainable params: 0
_________________________________________________________________

batch size = 121
epochs = 5
loss = categorical_crossentropy
optimizer = adam

Iteration 5
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
flatten_6 (Flatten)          (None, 784)               0         
_________________________________________________________________
dense_44 (Dense)             (None, 11)                8635      
_________________________________________________________________
dense_45 (Dense)             (None, 11)                132       
_________________________________________________________________
dense_46 (Dense)             (None, 11)                132       
_________________________________________________________________
dense_47 (Dense)             (None, 11)                132       
_________________________________________________________________
dense_48 (Dense)             (None, 11)                132       
_________________________________________________________________
dense_49 (Dense)             (None, 11)                132       
_________________________________________________________________
dense_50 (Dense)             (None, 11)                132       
_________________________________________________________________
dense_51 (Dense)             (None, 2)                 24        
=================================================================
Total params: 9,451
Trainable params: 9,451
Non-trainable params: 0
_________________________________________________________________

batch size = 83
epochs = 5
loss = categorical_crossentropy
optimizer = adam

Iteration 6
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
flatten_7 (Flatten)          (None, 784)               0         
_________________________________________________________________
dense_52 (Dense)             (None, 1)                 785       
_________________________________________________________________
dense_53 (Dense)             (None, 1)                 2         
_________________________________________________________________
dense_54 (Dense)             (None, 1)                 2         
_________________________________________________________________
dense_55 (Dense)             (None, 1)                 2         
_________________________________________________________________
dense_56 (Dense)             (None, 1)                 2         
_________________________________________________________________
dense_57 (Dense)             (None, 1)                 2         
_________________________________________________________________
dense_58 (Dense)             (None, 1)                 2         
_________________________________________________________________
dense_59 (Dense)             (None, 1)                 2         
_________________________________________________________________
dense_60 (Dense)             (None, 1)                 2         
_________________________________________________________________
dense_61 (Dense)             (None, 1)                 2         
_________________________________________________________________
dense_62 (Dense)             (None, 2)                 4         
=================================================================
Total params: 807
Trainable params: 807
Non-trainable params: 0
_________________________________________________________________

batch size = 90
epochs = 5
loss = categorical_crossentropy
optimizer = adam

Iteration 7
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
flatten_8 (Flatten)          (None, 784)               0         
_________________________________________________________________
dense_63 (Dense)             (None, 10)                7850      
_________________________________________________________________
dense_64 (Dense)             (None, 10)                110       
_________________________________________________________________
dense_65 (Dense)             (None, 10)                110       
_________________________________________________________________
dense_66 (Dense)             (None, 10)                110       
_________________________________________________________________
dense_67 (Dense)             (None, 10)                110       
_________________________________________________________________
dense_68 (Dense)             (None, 10)                110       
_________________________________________________________________
dense_69 (Dense)             (None, 2)                 22        
=================================================================
Total params: 8,422
Trainable params: 8,422
Non-trainable params: 0
_________________________________________________________________

batch size = 84
epochs = 5
loss = categorical_crossentropy
optimizer = adam

Iteration 8
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
flatten_9 (Flatten)          (None, 784)               0         
_________________________________________________________________
dense_70 (Dense)             (None, 5)                 3925      
_________________________________________________________________
dense_71 (Dense)             (None, 5)                 30        
_________________________________________________________________
dense_72 (Dense)             (None, 5)                 30        
_________________________________________________________________
dense_73 (Dense)             (None, 5)                 30        
_________________________________________________________________
dense_74 (Dense)             (None, 5)                 30        
_________________________________________________________________
dense_75 (Dense)             (None, 5)                 30        
_________________________________________________________________
dense_76 (Dense)             (None, 5)                 30        
_________________________________________________________________
dense_77 (Dense)             (None, 5)                 30        
_________________________________________________________________
dense_78 (Dense)             (None, 2)                 12        
=================================================================
Total params: 4,147
Trainable params: 4,147
Non-trainable params: 0
_________________________________________________________________

batch size = 73
epochs = 5
loss = categorical_crossentropy
optimizer = adam

Iteration 9
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
flatten_10 (Flatten)         (None, 784)               0         
_________________________________________________________________
dense_79 (Dense)             (None, 9)                 7065      
_________________________________________________________________
dense_80 (Dense)             (None, 9)                 90        
_________________________________________________________________
dense_81 (Dense)             (None, 9)                 90        
_________________________________________________________________
dense_82 (Dense)             (None, 9)                 90        
_________________________________________________________________
dense_83 (Dense)             (None, 9)                 90        
_________________________________________________________________
dense_84 (Dense)             (None, 9)                 90        
_________________________________________________________________
dense_85 (Dense)             (None, 9)                 90        
_________________________________________________________________
dense_86 (Dense)             (None, 9)                 90        
_________________________________________________________________
dense_87 (Dense)             (None, 9)                 90        
_________________________________________________________________
dense_88 (Dense)             (None, 9)                 90        
_________________________________________________________________
dense_89 (Dense)             (None, 2)                 20        
=================================================================
Total params: 7,895
Trainable params: 7,895
Non-trainable params: 0
_________________________________________________________________

batch size = 123
epochs = 5
loss = categorical_crossentropy
optimizer = adam

